const slides = document.getElementsByClassName("item");
let slideIndex = 1;

showSlides(slideIndex);

function nextSlide() {
  showSlides(slideIndex += 1);
}

function previousSlide() {
  showSlides(slideIndex -= 1);  
}

function currentSlide(n) {
  showSlides(slideIndex = n);
}

function showSlides(n) {
  if (n > slides.length) {
    slideIndex = 1
  }
  if (n < 1) {
      slideIndex = slides.length
  }

  for (let slide of slides) {
    slide.style.display = "none";
  }

    slides[slideIndex - 1].style.display = "block";    
}

setInterval(() => nextSlide(), 5000)

window.onload = () => {
  const newsContainer = document.querySelector('#news-container')
  const modalContainer = document.querySelector('#modal-container')
  const newsArr = ['5 июня – День эколога', 'В прошедшие выходные впервые в Твери Сбер провел Зеленый марафон!', 'ТЗВП – «Лучший переработчик пластика в России»! ', 'СОБИРАЕМСЯ НА ПОМОЩЬ ВОЛГЕ – ОЧИСТИМ БЕРЕГ ОТ МУСОРА']
  newsContentArr = ['Сотрудники нашего завода провели в детском саду № 33 занятие на экологическую тему и мастер – класс по изготовлению поделок из использованного пластика – все это приурочено к Дню эколога.<br><br>Надо отметить, что воспитанники этого сада уже много чего знают про экологию и переработку полезных отходов. Например, что из переработанного пластика можно сделать футболку! Удивили…<br><br>Мы с ними разобрали наш экочемоданчик - вещи из вторичного сырья. Узнали, что такое хлопушки и гранулы, из чего их делают. Слушали внимательно, дополняя меня ситуациями из жизни!<br><br>Растет отличная смена, они уж точно будут разделять отходы и бережно относится к окружающей среде! Молодцы ребята!На память все ребята получили в подарок экоручки, магнитики с нашим логотипом и вкусный сок!', 'А ТЗВП, в рамках Зеленого марафона, провели мастер – класс «Из мусорной кучки – классные штучки».<br><br>Отличный получился спортивный праздник! Марафон бежали различные тверские организации и предприятия, от детей до взрослых, до очень взрослых!<br><br> Так же в беге приняли участие люди с ограниченными физическими возможностями, проявив безграничную силу и волю к победе.<br><br>Каждый мог поставить в марафоне свой личный рекорд!<br><br>На площадке было многолюдно, весело и интересно. Для детей организовали детский городок.<br><br>Наш завод принял участие в его работе. Мы рассказали ребятам, как перерабатываем пластиковые отходы, показали вещи, сделанные из «вторички». А наш сотрудник, Надежда научила ребят делать поделки из использованного пластика – «Из мусорной кучки – классные штучки». Мастер – класс прошел на УРА! От желающих не было отбоя, всем интересно было смастерить своими руками бабочку, колокольчик, цветочек, а для этого понадобилась всего лишь пустая пластиковая бутылка и стаканчики из-под йогурта.<br><br>Вот так тоже можно перерабатывать пластиковые отходы – делать из них различные поделки, которые приносят радость и красоту!', 'С 22 по 23 мая в Санкт – Петербурге проходила Первая всероссийская премия по переработке пластика.<br>Организатор Премии ООО «ВторПрайс».<br><br>ВторПрайс – первое в России агентство по продажам вторичных ресурсов.<br>В Санкт – Петербург съехались представители перерабатывающей отрасли и потребители вторичного сырья. Специалисты в области экологического консалтинга и аналитики рынка рассказывали о рынке вторсырья в России, международных тенденциях и экологии, о технологиях работы со «вторичкой» на многослойном экструдере. Участники узнали все о пленочном производстве и о необходимом качестве. Один из самых опытных и известных технологов в полимерной индустрии поделился знаниями о методах оценки качества "вторички", об улучшение её свойств. И еще было много различных обсуждений и обмена опытом.<br><br>Наш Тверской Завод Вторичных Полимеров представляли Александр Щавелев – руководитель Коммерческого отдела и Сергей Лебедев – директор по развитию.<br>Конкурс «Переработчик пластика» - 100+ участников, 10 финалистов, 3 победителя.<br><br>Критерии оценки номинантов были следующие:<br>Объем перерабатываемой продукции<br>Качество перерабатываемого сырья<br>Количество приемных фракций<br>Работа с не приемными (сложными) фракциями<br>Количество лет на рынке<br>Глубина Переработки<br>Наличие Лицензии<br>Наличие ТУ на продукцию (Паспорт)<br><br>Наш завод получил премию "Лучший переработчик пластика в России"!', '11 июня на набережной в районе улицы Маяковского – присоединяйтесь к уборке берега Волги! Мы полезно проведём время и поможем разобраться с раздельным сбором отходов (пластик, стекло и прочие фракции). Все пластиковые отходы передадим для утилизации локальному переработчику – Тверскому заводу вторичных полимеров.<br><br>В рамках уборки вы:<br><br>Научитесь сортировать отходы<br>Приведёте в порядок любимый город<br>Не дадите отходам попасть в реку<br>Заведёте новые знакомства и проведёте время в компании единомышленников<br><br>Приходите с отличным настроением – а мы вам предоставим всё самое необходимое.<br><br>Для участия заполняйте форму – осталось совсем немного мест!<br><br>Встречаемся в 10:45 у центрального входа ТЦ «Восточный» (ул. Маяковского, 33) и вместе идём к месту уборки.<br><br>Уборка проводится ГК «EcoPartners» при содействии Администрации города Твери в рамках Федерального частного проекта «ЭкоОтвет». Проект реализует Ассоциация РусПРО совместно с партнерами в 10 регионах России.']

  for (news in newsArr) {
    newsContainer.innerHTML += `
      <div class="news__block">
        <h4 class="news__title" id="news-${news}">${newsArr[news]}</h4>
        <img src="images/news-${news}.jpg" alt="">
      </div>
    `
  }

  function modalClose() {
    console.log(modalContainer)
    modalContainer.innerHTML = ''
  }
  
  newsContainer.addEventListener('click', function(event) {
    switch (event.target.id) {
      case 'news-0': {
        modalContainer.innerHTML = `
        <div class="modal__container">
        <div class="modal__content">
        <div class="modal__close" id="modal-close">&#10006;</div>
        <h4 class="modal__title">${newsArr[0]}</h4>
        <img src="images/news-0.jpg" alt="">
        <p>${newsContentArr[0]}</p>
        </div>
        </div>
        `  
        break
      }
      case 'news-1': {
        modalContainer.innerHTML = `
        <div class="modal__container">
        <div class="modal__content">
        <div class="modal__close" id="modal-close">&#10006;</div>
        <h4 class="modal__title">${newsArr[1]}</h4>
        <img src="images/news-1.jpg" alt="">
        <p>${newsContentArr[1]}</p>
        </div>
        </div>
        `  
        break
      }
      case 'news-2': {
        modalContainer.innerHTML = `
        <div class="modal__container">
        <div class="modal__content">
        <div class="modal__close" id="modal-close">&#10006;</div>
        <h4 class="modal__title">${newsArr[2]}</h4>
        <img src="images/news-2.jpg" alt="">
        <p>${newsContentArr[2]}</p>
        </div>
        </div>
        `  
        break
      }
      case 'news-3': {
        modalContainer.innerHTML = `
        <div class="modal__container">
        <div class="modal__content">
        <div class="modal__close" id="modal-close">&#10006;</div>
        <h4 class="modal__title">${newsArr[3]}</h4>
        <img src="images/news-3.jpg" alt="">
        <p>${newsContentArr[3]}</p>
        </div>
        </div>
        `  
        break
      }
    }
  })
  modalContainer.addEventListener('click', event => {
    if (event.target.id === 'modal-close') modalContainer.innerHTML = ''
  })
}